{
  "personal": {
    "name": "Devendra Pratap Singh",
    "title": "Principal Software Engineer @ Spinny | Backend & Cloud Systems | Ex-Zynga (FarmVille) | Ex-BookMyShow",
    "logo": "DPS",
    "tagline": "Turning complex problems into simple, scalable systems.",
    "description": "Specialized in backend architecture, cloud platforms, and engineering leadership. Currently building automotive-tech solutions at Spinny. I value pragmatic trade-offs, system scalability, and clean design.",
    "location": "🌍 Based in India • 🌱 Vegetarian • 💡 Believes good engineering is about clarity — in systems and in communication",
    "email": "dps.manit@gmail.com",
    "phone": "+91-9424475996",
    "resumeUrl": "./assets/resume/Devendra_Pratap_Singh_Resume.pdf"
  },
  "about": {
    "title": "About Me",
    "subtitle": "Building scalable systems with clean architecture",
    "description": [
      "I'm a software engineer with 9+ years of professional experience in backend development, distributed systems, and cloud infrastructure. Currently at Spinny, building scalable automotive-tech solutions. Over the years, I've worked across diverse domains — automotive, gaming, fintech, blockchain, entertainment — with a strong focus on building systems that are scalable, secure, and reliable.",
      "At Zynga, I spent 5 years working on FarmVille 2 & 3, where I optimized performance for millions of players, cut pre-release times from hours to minutes, and built automation frameworks. At BookMyShow, I developed identity management systems and real-time monitoring tools. After Zynga, I took time to explore emerging technologies and evaluate strategic career moves before joining Fancraze, where I led engineering initiatives for cricket NFT platform. Now at Spinny, I'm focusing on building robust backend systems for India's largest used car platform.",
      "I believe in pragmatic problem-solving, mentoring teams, and designing systems that balance performance with long-term maintainability. I value being intentional about career transitions, using these periods to stay updated with industry trends and make thoughtful decisions about the next challenge. Outside work, I enjoy writing about tech, conducting mock interviews, and helping developers grow through mentorship."
    ],
    "technologies": [
      "Node.js",
      "Python",
      "Golang",
      "Java",
      "JavaScript",
      "Django",
      "FastAPI",
      "Express.js",
      "Koa.js",
      "PostgreSQL",
      "MongoDB",
      "MariaDB",
      "Redis",
      "Kafka",
      "RabbitMQ",
      "React",
      "Angular",
      "Docker",
      "Kubernetes",
      "GCP",
      "AWS",
      "C#",
      "PHP",
      "ActionScript",
      "Unity",
      "SAP PI"
    ],
    "interests": [
      "🏗️ System Design",
      "🔄 Microservices Architecture",
      "⚡ Performance Optimization",
      "🔧 DevOps & SRE",
      "☁️ Cloud Migrations",
      "🔍 Data Engineering",
      "📊 Observability & Monitoring",
      "👥 Engineering Leadership"
    ]
  },
  "services": {
    "title": "Services I offer on Topmate",
    "subtitle": "Comprehensive mentorship and interview preparation — technical excellence, career guidance, and real-world problem-solving.",
    "topmateUrl": "https://topmate.io/i0xdps",
    "offerings": [
      {
        "icon": "MI",
        "title": "🎯 Mock Interviews (60 min)",
        "description": "Live, structured mock interviews with detailed feedback — system design rounds, backend architecture, and deep dives into Java/Python/Go. Includes comprehensive written notes and personalized improvement roadmap."
      },
      {
        "icon": "1-1",
        "title": "👨‍💻 One-on-One Mentorship (30/60 min)",
        "description": "Focused sessions for career guidance, system design walkthroughs, code reviews, and technical leadership advice. Perfect for engineers looking to level up their skills or transition to senior/principal roles."
      },
      {
        "icon": "QD",
        "title": "⚡ Quick Doubt Call (15–20 min)",
        "description": "Short, focused calls to clear specific technical problems — debugging help, architecture decisions, interview preparation, or career-related questions. Quick and actionable solutions."
      },
      {
        "icon": "SD",
        "title": "🏗️ System Design Reviews (45 min)",
        "description": "Deep dive into your system design approaches, architecture decisions, and scalability considerations. Perfect for preparing for senior+ interviews or validating production system designs."
      }
    ]
  },
  "projects": {
    "title": "Featured Projects",
    "subtitle": "A selection of projects showcasing system design and engineering excellence",
    "items": [
      {
        "title": "Blockchain Dependency Re-architecture",
        "technologies": ["Node.js", "Golang", "MongoDB", "PostgreSQL", "Background Workers"],
        "description": "Re-architected the system to remove direct blockchain dependencies by making the database the primary source of truth, implementing background synchronization for NFTs and funds, reducing transaction times from minutes to seconds for end users.",
        "achievements": "Eliminated blockchain bottlenecks; improved user experience with near-instant transactions; enhanced system reliability and scalability"
      },
      {
        "title": "Comprehensive Financial Accounting System",
        "technologies": ["Node.js", "PostgreSQL", "Financial APIs", "Reporting Tools"],
        "description": "Designed and implemented a comprehensive accounting system to track all fund flows, including user transactions, platform revenue, and fees, ensuring transparent and accurate financial reporting.",
        "achievements": "Complete financial transparency; automated revenue tracking; accurate fee calculation and reporting for business intelligence"
      },
      {
        "title": "Game Performance Optimization & Automation",
        "technologies": ["ActionScript", "Python", "PHP", "C# Unity", "Node.js"],
        "description": "Optimized FarmVille game performance by refactoring asset data mapping, reducing memory usage from 40MB to 20KB. Built automation systems for game releases and dynamic feature management.",
        "achievements": "Reduced pre-release time from 2 hours to 15 minutes; eliminated need for legacy feature archiving through modular game-setting objects"
      },
      {
        "title": "Identity Management & Monitoring Systems",
        "technologies": ["Node.js", "Python", "Django", "Golang", "MongoDB", "MariaDB", "RabbitMQ", "Kafka"],
        "description": "Developed comprehensive Identity Access Management (IAM) system with LDAP integration and Universal Access Portal for BookMyShow. Built real-time cinema health monitoring and queue management systems.",
        "achievements": "Centralized access control for all internal projects; real-time operational monitoring; improved system performance and transparency through integrated monitoring tools"
      }
    ]
  },
  "experience": {
    "title": "Professional Experience",
    "subtitle": "Building scalable systems and leading technical initiatives",
    "items": [
      {
        "role": "🚀 Principal Software Engineer",
        "company": "Spinny (India's Largest Used Car Platform)",
        "period": "October 2025 - Present",
        "technologies": ["Python", "Django", "PostgreSQL", "Kafka"],
        "achievements": [
          "Leading backend architecture initiatives for India's largest used car marketplace",
          "Designing scalable systems to handle automotive inventory, pricing, and transaction workflows",
          "Focusing on performance optimization and system reliability for high-traffic automotive platform",
          "Contributing to technical strategy and engineering best practices"
        ]
      },
      {
        "role": "👨‍💼 Engineering Manager",
        "company": "Fancraze (Official Cricket NFT Provider)",
        "period": "April 2024 - August 2025",
        "technologies": ["Node.js", "Golang", "MongoDB", "PostgreSQL", "React"],
        "achievements": [
          "Led the successful migration of cloud infrastructure from AWS to Google Cloud Platform (GCP), improving scalability and cost efficiency",
          "Re-architected the system to remove direct blockchain dependencies by making the database the primary source of truth, implementing background synchronization for NFTs and funds, reducing transaction times from minutes to seconds for end users",
          "Designed and implemented a comprehensive accounting system to track all fund flows, including user transactions, platform revenue, and fees, ensuring transparent and accurate financial reporting",
          "Integrated Google Cloud Platform (GCP) Secret Manager, enabling secure management of sensitive configuration data for both local and server environments, ensuring that secrets remain protected and inaccessible to developers"
        ]
      },
      {
        "role": "🎮 Software Engineer Developer 2",
        "company": "Zynga Gaming",
        "period": "September 2018 - July 2023",
        "technologies": ["ActionScript", "Python", "PHP", "C# Unity", "Node.js", "React"],
        "achievements": [
          "Optimized in-game memory usage from 40MB to 20KB by refactoring game asset data mapping, resulting in significant performance improvements",
          "Accelerated the pre-release process, reducing execution time from nearly 2 hours to just 15 minutes through process optimization",
          "Improved both memory usage and setup time for local game environments, enabling faster onboarding and development cycles",
          "Designed and developed a system enabling custom scripts to run during game load without requiring a new release, allowing for greater flexibility and faster updates",
          "Designed and developed the end-to-end automation setup for the reskin feature in FarmVille 3, streamlining the process and significantly reducing manual effort",
          "Eliminated the need for archiving legacy features by designing dynamic, modular game-setting objects that load based on feature completion, enhancing scalability and maintainability"
        ]
      },
      {
        "role": "🎬 Software Engineer Developer",
        "company": "BookMyShow",
        "period": "November 2016 - September 2018",
        "technologies": ["Node.js", "Express", "Koa.js", "Python", "Django", "Golang", "PHP", "MongoDB", "MariaDB", "RabbitMQ", "Kafka", "Angular", "React"],
        "achievements": [
          "Developed Identity Access Management tool over Windows Active Directory, controlling internal projects and user access to company resources",
          "Built universal dashboard integrating all service dashboards with IAM permissions for centralized monitoring and access control",
          "Created cinema monitoring tools that assess availability by simulating ticket bookings and automatically disable inactive cinemas temporarily",
          "Migrated existing system from Mandrill Email Service to Amazon Web Services, optimizing communication services by filtering complaint and bounce emails",
          "Built Ticket Reselling Module during company hackathon and implemented health monitoring tool for real-time cinema status tracking",
          "Implemented end-to-end Queue Manager middleware solution with integrated monitoring capabilities"
        ]
      },
      {
        "role": "💼 Software Engineer Consultant",
        "company": "Incture Technologies",
        "period": "July 2015 - October 2016",
        "technologies": ["SAP PI", "Java", "Node.js", "Angular", "MongoDB"],
        "achievements": [
          "Started as 3-month internship where I learned professionalism, understood different services and teams and workflow",
          "Worked as SAP PI consultant integrating multiple services to map their invoices and streamline data flow",
          "Developed CherryWork app alongside the team, creating multiple end-to-end APIs from SAP BA through SAP PI, Java, to Node.js",
          "Implemented multiple UI components in Angular, contributing to full-stack development across the technology stack"
        ]
      }
    ]
  },
  "sideProjects": {
    "title": "Side Projects & Open Source",
    "subtitle": "Independent explorations, utilities & technical experiments",
    "items": [
      {
        "name": "Personal Portfolio & Technical Blog",
        "year": 2025,
        "description": "Modern portfolio website built with vanilla HTML/CSS/JS focusing on performance and clean design. Includes technical blog posts and mentorship services integration.",
        "technologies": ["HTML5", "CSS3", "JavaScript", "Performance Optimization"]
      },
      {
        "name": "Object Data Model for Google Sheets",
        "year": 2018,
        "description": "Python library to fetch Google Sheets data and convert it into class objects resembling Django ORM models. Simplifies data manipulation and validation workflows.",
        "technologies": ["Python", "Google Sheets API", "Object-Oriented Design"]
      },
      {
        "name": "Interview Preparation Resources",
        "year": "Ongoing",
        "description": "Curated collection of system design templates, coding interview patterns, and technical leadership resources shared through mentorship sessions.",
        "technologies": ["System Design", "Documentation", "Technical Writing"]
      },
      {
        "name": "DevOps Automation Scripts",
        "year": "2020-2024",
        "description": "Collection of automation scripts for deployment, monitoring, and infrastructure management used across different projects and companies.",
        "technologies": ["Python", "Bash", "Docker", "CI/CD", "Infrastructure Automation"]
      },
      {
        "name": "Windows Phone Application for GeeksforGeeks",
        "year": 2014,
        "description": "Windows phone application for geeksforgeeks.org providing mobile access to programming content and tutorials with offline reading capabilities.",
        "technologies": ["C# .Net", "Windows Phone Development Tools", "DOM Parser"]
      },
      {
        "name": "Facebook Logout Script",
        "year": 2013,
        "description": "User-based script installed on GreaseMonkey allowing users to logout from Facebook account by pressing ALT+L from keyboard, enhancing user convenience.",
        "technologies": ["JavaScript", "GreaseMonkey"]
      }
    ]
  },
  "achievements": {
    "title": "🏆 Achievements",
    "subtitle": "Recognition and accomplishments",
    "items": [
      {
        "title": "🥉 2nd Runner-Up Hackathon @ BookMyShow",
        "year": "April 2017",
        "description": "Achieved 2nd runner-up position in internal hackathon by developing innovative ticket reselling module solution"
      }
    ]
  },
  "education": {
    "degree": "🎓 B.Tech in Computer Science and Engineering",
    "institution": "National Institute of Technology, Bhopal",
    "period": "2011 - 2015",
    "grade": "6.4 CGPA"
  },
  "skills": {
    "primary": ["Java", "Python", "Go", "Node.js", "Spring Boot", "Django", "FastAPI"],
    "databases": ["PostgreSQL", "MySQL", "Redis", "MongoDB", "ClickHouse"],
    "devops": ["Docker", "Kubernetes", "GCP", "AWS", "CI/CD", "Infrastructure as Code"],
    "messaging": ["Apache Kafka", "RabbitMQ", "Google Pub/Sub", "Event-Driven Architecture"],
    "monitoring": ["Observability", "Performance Tuning", "APM Tools", "Logging & Alerting"],
    "leadership": ["Technical Leadership", "System Architecture", "Code Reviews", "Mentoring"]
  },
  "socialLinks": [
    {
      "name": "LinkedIn",
      "url": "https://www.linkedin.com/in/0xdps",
      "icon": "linkedin"
    },
    {
      "name": "GitHub",
      "url": "https://github.com/0xdps",
      "icon": "github"
    },
    {
      "name": "Twitter",
      "url": "https://twitter.com/0xdps",
      "icon": "twitter"
    },
    {
      "name": "Medium",
      "url": "https://0xdps.medium.com",
      "icon": "medium"
    }
  ]
}